tomyqg/STM32_RTT_F107/ECU/main/src/zigbee.c
		//rt_thread_delay(RT_TICK_PER_SECOND/2);
		temp_size = ZIGBEE_SERIAL.read(&ZIGBEE_SERIAL,0, data_all, 255);
		size = temp_size -12;

		for(i=0;i<size;i++)
		{
			data[i]=data_all[i+12];
		}
		printhexmsg(ECU_DBG_MAIN,"Reply", data_all, temp_size);
		rt_sprintf(inverterid,"%02x%02x%02x%02x%02x%02x",data_all[6],data_all[7],data_all[8],data_all[9],data_all[10],data_all[11]);
		if((size>0)&&(0xFC==data_all[0])&&(0xFC==data_all[1])&&(data_all[2]==inverter->shortaddr/256)&&(data_all[3]==inverter->shortaddr%256)&&(0==rt_strcmp(inverter->id,inverterid)))
		{
			inverter->raduis=data_all[5];
			inverter->signalstrength=data_all[4];
			return size;
		}
		else
		{
			inverter->signalstrength=0;
			return -1;
		}
	}

}

int zb_get_reply_update_start(char *data,inverter_info *inverter)			//读取逆变器远程更新的Update_start返回帧，ZK，返回响应时间定为10秒
{
	int i;
	char data_all[256];
	char inverterid[13] = {'\0'};
	int temp_size,size;

	if(selectZigbee(10) <= 0)
	{
		printmsg(ECU_DBG_MAIN,"Get reply time out");
		return -1;
	}
	else
	{
		//rt_thread_delay(RT_TICK_PER_SECOND/5);
		temp_size = ZIGBEE_SERIAL.read(&ZIGBEE_SERIAL,0, data_all, 255);
		size = temp_size -12;

		for(i=0;i<size;i++)
		{
			data[i]=data_all[i+12];
		}
		printhexmsg(ECU_DBG_MAIN,"Reply", data_all, temp_size);
		rt_sprintf(inverterid,"%02x%02x%02x%02x%02x%02x",data_all[6],data_all[7],data_all[8],data_all[9],data_all[10],data_all[11]);
		if((size>0)&&(0xFC==data_all[0])&&(0xFC==data_all[1])&&(data_all[2]==inverter->shortaddr/256)&&(data_all[3]==inverter->shortaddr%256)&&(data_all[5]==0xA5)&&(0==rt_strcmp(inverter->id,inverterid)))
		{
			return size;
		}
		else
		{
			return -1;
		}
	}

}

int zb_get_reply_restore(char *data,inverter_info *inverter)			//读取逆变器远程更新失败，还原指令后的返回帧，ZK，因为还原时间比较长，所以单独写一个函数
{
	int i;
	char data_all[256];
	char inverterid[13] = {'\0'};
	int temp_size,size;

	if(selectZigbee(200) <= 0)
	{
		printmsg(ECU_DBG_MAIN,"Get reply time out");
		return -1;
	}
	else
	{
		//rt_thread_delay(RT_TICK_PER_SECOND/5);
		temp_size = ZIGBEE_SERIAL.read(&ZIGBEE_SERIAL,0, data_all, 255);
		size = temp_size -12;
		
		for(i=0;i<size;i++)
		{
			data[i]=data_all[i+12];
		}
		printhexmsg(ECU_DBG_MAIN,"Reply", data_all, temp_size);
		rt_sprintf(inverterid,"%02x%02x%02x%02x%02x%02x",data_all[6],data_all[7],data_all[8],data_all[9],data_all[10],data_all[11]);

		if((size>0)&&(0xFC==data_all[0])&&(0xFC==data_all[1])&&(data_all[2]==inverter->shortaddr/256)&&(data_all[3]==inverter->shortaddr%256)&&(data_all[5]==0xA5)&&(0==rt_strcmp(inverter->id,inverterid)))
		{
			return size;
		}
		else
		{
			return -1;
		}	
	}
}

int zb_get_reply_from_module(char *data)			//读取zigbee模块的返回帧
{
	int size = 0;

	if(selectZigbee(2) <= 0)
	{
		printmsg(ECU_DBG_MAIN,"Get reply time out");
		return -1;
	}else
	{
		//rt_thread_delay(RT_TICK_PER_SECOND/4);
		size = ZIGBEE_SERIAL.read(&ZIGBEE_SERIAL,0, data, 255);
		if(size > 0)
		{
			printhexmsg(ECU_DBG_MAIN,"Reply", data, size);
			return size;
		}else
		{
			return -1;
		}
	}	
}

int zb_get_id(char *data)			//获取逆变器ID
{
	int size;

	if(selectZigbee(30) <= 0){
		printmsg(ECU_DBG_MAIN,"Get id time out");
		return -1;
	}
	else{
		//rt_thread_delay(RT_TICK_PER_SECOND/5);
		size = ZIGBEE_SERIAL.read(&ZIGBEE_SERIAL,0, data, 255);
		printhexmsg(ECU_DBG_MAIN,"Reply", data, size);
		return size;
	}
}

int zb_turnoff_limited_rptid(int short_addr,inverter_info *inverter)			//关闭限定单个逆变器上报ID功能
{
	unsigned char sendbuff[512] = {'\0'};
	int i=0, ret;
	char data[256];
	int check=0;

	clear_zbmodem();			//发送指令前，先清空缓冲区
	sendbuff[0]  = 0xAA;
	sendbuff[1]  = 0xAA;
	sendbuff[2]  = 0xAA;
	sendbuff[3]  = 0xAA;
	sendbuff[4]  = 0x08;
	sendbuff[5]  = short_addr>>8;
	sendbuff[6]  = short_addr;
	sendbuff[7]  = 0x08;//panid
	sendbuff[8]  = 0x88;
	sendbuff[9]  = 0x19;
	sendbuff[10] = 0x00;
	sendbuff[11] = 0xA0;
	for(i=4;i<12;i++)
		check=check+sendbuff[i];
	sendbuff[12] = check/256;
	sendbuff[13] = check%256;
	sendbuff[14] = 0x00;

	if(0!=inverter->shortaddr)
	{
		printmsg(ECU_DBG_MAIN,"Turn off limited report id");
		ZIGBEE_SERIAL.write(&ZIGBEE_SERIAL, 0,sendbuff, 15);
		printhexmsg(ECU_DBG_MAIN,"sendbuff",(char *)sendbuff,15);
		ret = zb_get_reply_from_module(data);
		if((11 == ret)&&(0xA5 == data[2])&&(0xA5 == data[3]))
		{
			if(inverter->zigbee_version!=data[9])
			{
				inverter->zigbee_version = data[9];
//				update_zigbee_version(inverter);
			}
			return 1;
		}
		else
			return -1;
	}
	else
		return -1;

}

int zb_turnoff_rptid(int short_addr)			//关闭单个逆变器上报ID功能
{
	unsigned char sendbuff[512] = {'\0'};
	int i=0;
	int check=0;
	printmsg(ECU_DBG_MAIN,"Turn off report id");

	sendbuff[0]  = 0xAA;
	sendbuff[1]  = 0xAA;
	sendbuff[2]  = 0xAA;
	sendbuff[3]  = 0xAA;
	sendbuff[4]  = 0x08;
	sendbuff[5]  = short_addr>>8;
	sendbuff[6]  = short_addr;
	sendbuff[7]  = 0x08;//panid
	sendbuff[8]  = 0x88;
	sendbuff[9]  = 0x19;
	sendbuff[10] = 0x00;
	sendbuff[11] = 0x00;
	for(i=4;i<12;i++)
		check=check+sendbuff[i];
	sendbuff[12] = check/256;
	sendbuff[13] = check%256;
	sendbuff[14] = 0x00;

	ZIGBEE_SERIAL.write(&ZIGBEE_SERIAL, 0, sendbuff, 15);
//	ret = zb_get_reply(data);
//	if((11 == ret)&&(0xA5 == data[2])&&(0xA5 == data[3]))
		return 1;
//	else
//		return -1;
}

int zb_get_inverter_shortaddress_single(inverter_info *inverter)			//获取单台指定逆变器短地址，ZK
{
	unsigned char sendbuff[512] = {'\0'};
	int i=0, ret;
	char data[256];
	char inverterid[13] = {'\0'};
	int check=0;
	printmsg(ECU_DBG_MAIN,"Get inverter shortaddresssingle");

	clear_zbmodem();			//发送指令前先清空缓冲区
	sendbuff[0]  = 0xAA;
	sendbuff[1]  = 0xAA;
	sendbuff[2]  = 0xAA;
	sendbuff[3]  = 0xAA;
	sendbuff[4]  = 0x0E;
	sendbuff[5]  = 0x00;
	sendbuff[6]  = 0x00;
	sendbuff[7]  = 0x00;//panid
	sendbuff[8]  = 0x00;
	sendbuff[9]  = 0x00;
	sendbuff[10] = 0x00;
	sendbuff[11] = 0x00;
	for(i=4;i<12;i++)
		check=check+sendbuff[i];
	sendbuff[12] = check/256;
	sendbuff[13] = check%256;
	sendbuff[14] = 0x06;

	sendbuff[15]=((inverter->id[0]-0x30)*16+(inverter->id[1]-0x30));
	sendbuff[16]=((inverter->id[2]-0x30)*16+(inverter->id[3]-0x30));
	sendbuff[17]=((inverter->id[4]-0x30)*16+(inverter->id[5]-0x30));
	sendbuff[18]=((inverter->id[6]-0x30)*16+(inverter->id[7]-0x30));
	sendbuff[19]=((inverter->id[8]-0x30)*16+(inverter->id[9]-0x30));
	sendbuff[20]=((inverter->id[10]-0x30)*16+(inverter->id[11]-0x30));

//	strcpy(&sendbuff[15],inverter->inverterid);


	ZIGBEE_SERIAL.write(&ZIGBEE_SERIAL, 0, sendbuff, 21);
	printhexmsg(ECU_DBG_MAIN,"sendbuff",(char *)sendbuff,21);
	ret = zb_get_reply_from_module(data);

	rt_sprintf(inverterid,"%02x%02x%02x%02x%02x%02x",data[4],data[5],data[6],data[7],data[8],data[9]);

